Table of Contents
 Class LoadingSLS
Namespace
IdeaRS.OpenModel.Concrete.Load
Assembly
IdeaRS.OpenModel.dll
Loading SLS
public class LoadingSLS
Inheritance
object
LoadingSLS
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 LoadingSLS()
Constructor
public LoadingSLS()
Properties
 InternalForces
Internal force in section (permanent for staged section)
public ResultOfInternalForces InternalForces { get; set; }
Property Value
ResultOfInternalForces
 InternalForcesImperfection
Internal forces of imperfection effect
public ResultOfInternalForces InternalForcesImperfection { get; set; }
Property Value
ResultOfInternalForces
 InternalForcesVariable
Variable internal force in staged section only
public ResultOfInternalForces InternalForcesVariable { get; set; }
Property Value
ResultOfInternalForces
 Edit this page